/*
 Navicat Premium Data Transfer

 Source Server         : itheima
 Source Server Type    : MySQL
 Source Server Version : 80026
 Source Host           : localhost:3306
 Source Schema         : smart_campus

 Target Server Type    : MySQL
 Target Server Version : 80026
 File Encoding         : 65001

 Date: 12/11/2025 13:08:34
*/

SET NAMES utf8mb4;
SET
FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for drugs
-- ----------------------------
DROP TABLE IF EXISTS `drugs`;
CREATE TABLE `drugs`
(
    `id`              bigint                                                        NOT NULL AUTO_INCREMENT COMMENT '主键',
    `img`             longblob                                                      NOT NULL COMMENT '图片',
    `drug_id`         varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '药品ID',
    `type_id`         int                                                           NOT NULL COMMENT '药品类型id',
    `name`            varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '药品名字',
    `price`           decimal(10, 2)                                                NOT NULL COMMENT '价格',
    `quantity`        int                                                           NOT NULL COMMENT '数量',
    `specifications`  varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '规格',
    `type`            varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '类型',
    `usage1`          varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '用法',
    `dosage`          varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '使用剂量',
    `manufacturer`    varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '生产厂家',
    `expiration_date` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '有效期',
    `symptoms`        varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '症状',
    `notes`           varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '备注',
    `create_time`     datetime                                                      NOT NULL COMMENT '创建时间',
    `update_time`     datetime                                                      NOT NULL COMMENT '最后修改时间',
    PRIMARY KEY (`id`) USING BTREE,
    INDEX             `drug_id`(`drug_id` ASC) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 174 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of drugs
-- ----------------------------
INSERT INTO `drugs`
VALUES (1, 0x31, '1', 1, '感冒灵', 20.50, 100, '10片/盒', '感冒药', '口服', '一次2片，一日3次', 'XX制药', '2025-12-31', '感冒', '',
        '2024-03-25 19:47:53', '2024-03-25 19:47:53');
INSERT INTO `drugs`
VALUES (2, 0x31, '2', 1, '感冒灵', 20.50, 100, '10片/盒', '天帝', '口服', '一次2片，一日3次', 'XX制药', '2025-12-31', '感冒', '',
        '2024-03-25 19:47:53', '2024-03-25 23:14:21');
INSERT INTO `drugs`
VALUES (3, 0x31, '3', 1, '感冒灵', 20.50, 100, '10片/盒', '感冒药', '口服', '一次2片，一日3次', 'XX制药', '2025-12-31', '感冒', '',
        '2024-03-25 19:47:53', '2024-03-25 19:47:53');
INSERT INTO `drugs`
VALUES (4, 0x31, '4', 1, '感冒灵', 20.50, 100, '10片/盒', '感冒药', '口服', '一次2片，一日3次', 'XX制药', '2025-12-31', '感冒', '',
        '2024-03-25 19:47:53', '2024-03-25 19:47:53');
INSERT INTO `drugs`
VALUES (5, 0x31, '5', 1, '感冒灵', 20.50, 100, '10片/盒', '感冒药', '口服', '一次2片，一日3次', 'XX制药', '2025-12-31', '感冒', '',
        '2024-03-25 19:47:53', '2024-03-25 19:47:53');
INSERT INTO `drugs`
VALUES (6, 0x31, '6', 1, '感冒灵', 20.50, 100, '10片/盒', '感冒药', '口服', '一次2片，一日3次', 'XX制药', '2025-12-31', '感冒', '',
        '2024-03-25 19:47:53', '2024-03-25 19:47:53');
INSERT INTO `drugs`
VALUES (7, 0x31, '7', 1, '感冒灵', 20.50, 100, '10片/盒', '感冒药', '口服', '一次2片，一日3次', 'XX制药', '2025-12-31', '感冒', '',
        '2024-03-25 19:47:53', '2024-03-25 19:47:53');
INSERT INTO `drugs`
VALUES (8, 0x31, '8', 1, '感冒灵', 20.50, 100, '10片/盒', '感冒药', '口服', '一次2片，一日3次', 'XX制药', '2025-12-31', '感冒', '',
        '2024-03-25 19:47:53', '2024-03-25 19:47:53');
INSERT INTO `drugs`
VALUES (124, 0x706C616365686F6C6465725F696D6731, 'D001', 1, '药品1', 20.00, 100, '100mg', '类型A', '口服', '每次1片，每日3次',
        '制药公司A', '2024-12-31', '头痛', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (125, 0x706C616365686F6C6465725F696D6732, 'D002', 2, '药品2', 30.00, 80, '200mg', '类型B', '口服', '每次2片，每日2次',
        '制药公司B', '2024-12-31', '发烧', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (126, 0x706C616365686F6C6465725F696D6733, 'D003', 1, '药品3', 25.00, 120, '150mg', '类型A', '口服', '每次1片，每日4次',
        '制药公司C', '2024-12-31', '咳嗽', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (127, 0x706C616365686F6C6465725F696D6734, 'D004', 3, '药品4', 15.00, 150, '50mg', '类型C', '口服', '每次1片，每日3次',
        '制药公司D', '2024-12-31', '感冒', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (128, 0x706C616365686F6C6465725F696D6735, 'D005', 2, '药品5', 40.00, 90, '300mg', '类型B', '口服', '每次2片，每日2次',
        '制药公司E', '2024-12-31', '头痛', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (129, 0x706C616365686F6C6465725F696D6736, 'D006', 1, '药品6', 18.00, 200, '100mg', '类型A', '口服', '每次1片，每日3次',
        '制药公司F', '2024-12-31', '咳嗽', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (130, 0x706C616365686F6C6465725F696D6737, 'D007', 3, '药品7', 22.00, 110, '150mg', '类型C', '口服', '每次1片，每日4次',
        '制药公司G', '2024-12-31', '感冒', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (131, 0x706C616365686F6C6465725F696D6738, 'D008', 2, '药品8', 35.00, 70, '200mg', '类型B', '口服', '每次2片，每日2次',
        '制药公司H', '2024-12-31', '发烧', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (132, 0x706C616365686F6C6465725F696D6739, 'D009', 1, '药品9', 27.00, 180, '250mg', '类型A', '口服', '每次1片，每日3次',
        '制药公司I', '2024-12-31', '咳嗽', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (133, 0x706C616365686F6C6465725F696D673130, 'D010', 3, '药品10', 17.00, 130, '100mg', '类型C', '口服', '每次1片，每日4次',
        '制药公司J', '2024-12-31', '感冒', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (134, 0x706C616365686F6C6465725F696D6731, 'D0011', 1, '药品1', 20.00, 100, '100mg', '类型A', '口服', '每次1片，每日3次',
        '制药公司K', '2024-12-31', '头痛', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (135, 0x706C616365686F6C6465725F696D6732, 'D0012', 2, '药品2', 30.00, 80, '200mg', '类型B', '口服', '每次2片，每日2次',
        '制药公司L', '2024-12-31', '发烧', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (136, 0x706C616365686F6C6465725F696D6733, 'D0013', 1, '药品3', 25.00, 120, '150mg', '类型A', '口服', '每次1片，每日4次',
        '制药公司N', '2024-12-31', '咳嗽', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (137, 0x706C616365686F6C6465725F696D6734, 'D0014', 3, '药品4', 15.00, 150, '50mg', '类型C', '口服', '每次1片，每日3次',
        '制药公司M', '2024-12-31', '感冒', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (138, 0x706C616365686F6C6465725F696D6735, 'D0015', 2, '药品5', 40.00, 90, '300mg', '类型B', '口服', '每次2片，每日2次',
        '制药公司O', '2024-12-31', '头痛', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (139, 0x706C616365686F6C6465725F696D6736, 'D0016', 1, '药品6', 18.00, 200, '100mg', '类型A', '口服', '每次1片，每日3次',
        '制药公司P', '2024-12-31', '咳嗽', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (140, 0x706C616365686F6C6465725F696D6737, 'D0017', 3, '药品7', 22.00, 110, '150mg', '类型C', '口服', '每次1片，每日4次',
        '制药公司Q', '2024-12-31', '感冒', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (141, 0x706C616365686F6C6465725F696D6738, 'D0018', 2, '药品8', 35.00, 70, '200mg', '类型B', '口服', '每次2片，每日2次',
        '制药公司R', '2024-12-31', '发烧', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (142, 0x706C616365686F6C6465725F696D6739, 'D0019', 1, '药品9', 27.00, 180, '250mg', '类型A', '口服', '每次1片，每日3次',
        '制药公司S', '2024-12-31', '咳嗽', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (143, 0x706C616365686F6C6465725F696D673130, 'D0020', 3, '药品10', 17.00, 130, '100mg', '类型C', '口服', '每次1片，每日4次',
        '制药公司T', '2024-12-31', '感冒', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (144, 0x706C616365686F6C6465725F696D6731, 'D0011', 1, '药品1', 20.00, 100, '100mg', '类型A', '口服', '每次1片，每日3次',
        '制药公司K', '2024-12-31', '头痛', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (145, 0x706C616365686F6C6465725F696D6732, 'D0012', 2, '药品2', 30.00, 80, '200mg', '类型B', '口服', '每次2片，每日2次',
        '制药公司L', '2024-12-31', '发烧', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (146, 0x706C616365686F6C6465725F696D6733, 'D0013', 1, '药品3', 25.00, 120, '150mg', '类型A', '口服', '每次1片，每日4次',
        '制药公司N', '2024-12-31', '咳嗽', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (147, 0x706C616365686F6C6465725F696D6734, 'D0014', 3, '药品4', 15.00, 150, '50mg', '类型C', '口服', '每次1片，每日3次',
        '制药公司M', '2024-12-31', '感冒', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (148, 0x706C616365686F6C6465725F696D6735, 'D0015', 2, '药品5', 40.00, 90, '300mg', '类型B', '口服', '每次2片，每日2次',
        '制药公司O', '2024-12-31', '头痛', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (149, 0x706C616365686F6C6465725F696D6736, 'D0016', 1, '药品6', 18.00, 200, '100mg', '类型A', '口服', '每次1片，每日3次',
        '制药公司P', '2024-12-31', '咳嗽', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (150, 0x706C616365686F6C6465725F696D6737, 'D0017', 3, '药品7', 22.00, 110, '150mg', '类型C', '口服', '每次1片，每日4次',
        '制药公司Q', '2024-12-31', '感冒', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (151, 0x706C616365686F6C6465725F696D6738, 'D0018', 2, '药品8', 35.00, 70, '200mg', '类型B', '口服', '每次2片，每日2次',
        '制药公司R', '2024-12-31', '发烧', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (152, 0x706C616365686F6C6465725F696D6739, 'D0019', 1, '药品9', 27.00, 180, '250mg', '类型A', '口服', '每次1片，每日3次',
        '制药公司S', '2024-12-31', '咳嗽', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (153, 0x706C616365686F6C6465725F696D673130, 'D0020', 3, '药品10', 17.00, 130, '100mg', '类型C', '口服', '每次1片，每日4次',
        '制药公司T', '2024-12-31', '感冒', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (154, 0x706C616365686F6C6465725F696D6731, 'D0011', 1, '药品1', 20.00, 100, '100mg', '类型A', '口服', '每次1片，每日3次',
        '制药公司K', '2024-12-31', '头痛', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (155, 0x706C616365686F6C6465725F696D6732, 'D0012', 2, '药品2', 30.00, 80, '200mg', '类型B', '口服', '每次2片，每日2次',
        '制药公司L', '2024-12-31', '发烧', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (156, 0x706C616365686F6C6465725F696D6733, 'D0013', 1, '药品3', 25.00, 120, '150mg', '类型A', '口服', '每次1片，每日4次',
        '制药公司N', '2024-12-31', '咳嗽', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (157, 0x706C616365686F6C6465725F696D6734, 'D0014', 3, '药品4', 15.00, 150, '50mg', '类型C', '口服', '每次1片，每日3次',
        '制药公司M', '2024-12-31', '感冒', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (158, 0x706C616365686F6C6465725F696D6735, 'D0015', 2, '药品5', 40.00, 90, '300mg', '类型B', '口服', '每次2片，每日2次',
        '制药公司O', '2024-12-31', '头痛', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (159, 0x706C616365686F6C6465725F696D6736, 'D0016', 1, '药品6', 18.00, 200, '100mg', '类型A', '口服', '每次1片，每日3次',
        '制药公司P', '2024-12-31', '咳嗽', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (160, 0x706C616365686F6C6465725F696D6737, 'D0017', 3, '药品7', 22.00, 110, '150mg', '类型C', '口服', '每次1片，每日4次',
        '制药公司Q', '2024-12-31', '感冒', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (161, 0x706C616365686F6C6465725F696D6738, 'D0018', 2, '药品8', 35.00, 70, '200mg', '类型B', '口服', '每次2片，每日2次',
        '制药公司R', '2024-12-31', '发烧', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (162, 0x706C616365686F6C6465725F696D6739, 'D0019', 1, '药品9', 27.00, 180, '250mg', '类型A', '口服', '每次1片，每日3次',
        '制药公司S', '2024-12-31', '咳嗽', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (163, 0x706C616365686F6C6465725F696D673130, 'D0020', 3, '药品10', 17.00, 130, '100mg', '类型C', '口服', '每次1片，每日4次',
        '制药公司T', '2024-12-31', '感冒', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (164, 0x706C616365686F6C6465725F696D6731, 'D0011', 1, '药品1', 20.00, 100, '100mg', '类型A', '口服', '每次1片，每日3次',
        '制药公司K', '2024-12-31', '头痛', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (165, 0x706C616365686F6C6465725F696D6732, 'D0012', 2, '药品2', 30.00, 80, '200mg', '类型B', '口服', '每次2片，每日2次',
        '制药公司L', '2024-12-31', '发烧', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (166, 0x706C616365686F6C6465725F696D6733, 'D0013', 1, '药品3', 25.00, 120, '150mg', '类型A', '口服', '每次1片，每日4次',
        '制药公司N', '2024-12-31', '咳嗽', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (167, 0x706C616365686F6C6465725F696D6734, 'D0014', 3, '药品4', 15.00, 150, '50mg', '类型C', '口服', '每次1片，每日3次',
        '制药公司M', '2024-12-31', '感冒', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (168, 0x706C616365686F6C6465725F696D6735, 'D0015', 2, '药品5', 40.00, 90, '300mg', '类型B', '口服', '每次2片，每日2次',
        '制药公司O', '2024-12-31', '头痛', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (169, 0x706C616365686F6C6465725F696D6736, 'D0016', 1, '药品6', 18.00, 200, '100mg', '类型A', '口服', '每次1片，每日3次',
        '制药公司P', '2024-12-31', '咳嗽', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (170, 0x706C616365686F6C6465725F696D6737, 'D0017', 3, '药品7', 22.00, 110, '150mg', '类型C', '口服', '每次1片，每日4次',
        '制药公司Q', '2024-12-31', '感冒', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (171, 0x706C616365686F6C6465725F696D6738, 'D0018', 2, '药品8', 35.00, 70, '200mg', '类型B', '口服', '每次2片，每日2次',
        '制药公司R', '2024-12-31', '发烧', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (172, 0x706C616365686F6C6465725F696D6739, 'D0019', 1, '药品9', 27.00, 180, '250mg', '类型A', '口服', '每次1片，每日3次',
        '制药公司S', '2024-12-31', '咳嗽', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');
INSERT INTO `drugs`
VALUES (173, 0x706C616365686F6C6465725F696D673130, 'D0020', 3, '药品10', 17.00, 130, '100mg', '类型C', '口服', '每次1片，每日4次',
        '制药公司T', '2024-12-31', '感冒', '无', '2024-03-30 08:00:00', '2024-03-30 08:00:00');

SET
FOREIGN_KEY_CHECKS = 1;
